# Data management using Pandas

**Data management** is a crucial component to statistical analysis and data science work. 

This notebook will show you how to import, view, undertand, and manage your data using the [Pandas](http://pandas.pydata.org) data processing library, i.e., the notebook will demonstrates how to read a dataset into Python, and obtain a basic understanding of its content.

Note that **Python** by itself is a general-purpose programming language and does not provide high-level data processing capabilities.  The **Pandas** library was developed to meet this need. **Pandas** is the most popular Python library for data manipulation, and we will use it extensively in this course. **Pandas** provides high-performance, easy-to-use data structures and data analysis tools.

The main data structure that **Pandas** works with is called a **Data Frame**. This is a two-dimensional table of data in which the rows typically
represent cases and the columns represent variables (e.g. data used in this tutorial).  Pandas also has a one-dimensional data structure called a **Series** that we will encounter when accesing a single column of a Data Frame.

Pandas has a variety of functions named `read_xxx` for reading data in different formats.  Right now we will focus on reading `csv` files, which stands for comma-separated values. However the other file formats include `excel`, `json`, and `sql`. 

There are many other options to `read_csv` that are very useful.  For example, you would use the option `sep='\t'` instead of the default `sep=','` if the fields of your data file are delimited by tabs instead of commas.  See [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html) for the full documentation for `read_csv`.


## Acknowledgments

- The dataset used in this tutorial is from https://www.coursera.org/ from the course "Understanding and Visualizing Data with Python" by University of Michigan

Alumno: Hector Rafael Alvarez Aceves
Matrícula: A01632621

# Importing libraries

In [118]:
# Import the packages that we will be using
import pandas as pd

# Importing data

In [166]:
# url string that hosts our .csv file
ruta = "datasets/iris/iris.csv"
# Read the .csv file and store it as a pandas Data Frame
df = pd.read_csv(ruta)

If we want to print the information about th output object type we would simply type the following: type(df)

In [63]:
type(df)

pandas.core.frame.DataFrame

# Exploring the content of the data set

Use the `shape` method to determine the numbers of rows and columns in a data frame. This can be used to confirm that we have actually obtained the data the we are expecting.

Based on what we see below, the data set being read here has $N_r$ rows, corresponding to $N_r$ observations, and $N_c$ columns, corresponding to $N_c$ variables in this particular data file.

In [64]:
Nr, Nc = df.shape

print(Nr)
print(Nc)

150
5

If we want to show the entire data frame we would simply write the following:

In [65]:
df

     LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo         Especie
0            5.1          3.5          1.4          0.2     Iris-setosa
1            4.9          3.0          1.4          0.2     Iris-setosa
2            4.7          3.2          1.3          0.2     Iris-setosa
3            4.6          3.1          1.5          0.2     Iris-setosa
4            5.0          3.6          1.4          0.2     Iris-setosa
..           ...          ...          ...          ...             ...
145          6.7          3.0          5.2          2.3  Iris-virginica
146          6.3          2.5          5.0          1.9  Iris-virginica
147          6.5          3.0          5.2          2.0  Iris-virginica
148          6.2          3.4          5.4          2.3  Iris-virginica
149          5.9          3.0          5.1          1.8  Iris-virginica

[150 rows x 5 columns]

As you can see, we have a 2-Dimensional object where each row is an independent observation and each coloum is a variable.

Now, use the the `head()` function to show the first 5 rows of our data frame

In [66]:
df.head(3)

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa

Also, you can use the the `tail()` function to show the last 5 rows of our data frame

In [67]:
df.tail(3)

     LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo         Especie
147          6.5          3.0          5.2          2.0  Iris-virginica
148          6.2          3.4          5.4          2.3  Iris-virginica
149          5.9          3.0          5.1          1.8  Iris-virginica

The columns in a Pandas data frame have names, to see the names, use the `columns` method:

To gather more information regarding the data, we can view the column names with the following function:

In [68]:
df.columns

Index(['LargoSepalo', 'AnchoSepalo', 'LargoPetalo', 'AnchoPetalo', 'Especie'], dtype='object')

Be aware that every variable in a Pandas data frame has a data type.  There are many different data types, but most commonly you will encounter floating point values (real numbers), integers, strings (text), and date/time values.  When Pandas reads a text/csv file, it guesses the data types based on what it sees in the first few rows of the data file.  Usually it selects an appropriate type, but occasionally it does not.  To confirm that the data types are consistent with what the variables represent, inspect the `dtypes` attribute of the data frame.

In [69]:
df.dtypes

LargoSepalo    float64
AnchoSepalo    float64
LargoPetalo    float64
AnchoPetalo    float64
Especie         object
dtype: object

Summary statistics, which include things like the mean, min, and max of the data, can be useful to get a feel for how large some of the variables are and what variables may be the most important.

In [70]:
# Summary statistics for the quantitative variables
df.describe()

       LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo
count   150.000000   150.000000   150.000000   150.000000
mean      5.843333     3.057333     3.758000     1.199333
std       0.828066     0.435866     1.765298     0.762238
min       4.300000     2.000000     1.000000     0.100000
25%       5.100000     2.800000     1.600000     0.300000
50%       5.800000     3.000000     4.350000     1.300000
75%       6.400000     3.300000     5.100000     1.800000
max       7.900000     4.400000     6.900000     2.500000

In [71]:
# Drop observations with NaN values
#df.Age.dropna().describe()
#df.Wingspan.dropna().describe()

df.Especie.dropna().describe()

count             150
unique              3
top       Iris-setosa
freq               50
Name: Especie, dtype: object

It is also possible to get statistics on the entire data frame or a column as follows

- `df.mean()` Returns the mean of all columns
- `df.corr()` Returns the correlation between columns in a data frame
- `df.count()` Returns the number of non-null values in each data frame column
- `df.max()` Returns the highest value in each column
- `df.min()` Returns the lowest value in each column
- `df.median()` Returns the median of each column
- `df.std()` Returns the standard deviation of each column

In [72]:
df.mean()

LargoSepalo    5.843333
AnchoSepalo    3.057333
LargoPetalo    3.758000
AnchoPetalo    1.199333
dtype: float64

In [73]:
df.corr()

             LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo
LargoSepalo     1.000000    -0.117570     0.871754     0.817941
AnchoSepalo    -0.117570     1.000000    -0.428440    -0.366126
LargoPetalo     0.871754    -0.428440     1.000000     0.962865
AnchoPetalo     0.817941    -0.366126     0.962865     1.000000

In [74]:
df.count()

LargoSepalo    150
AnchoSepalo    150
LargoPetalo    150
AnchoPetalo    150
Especie        150
dtype: int64

In [75]:
df.max()

LargoSepalo               7.9
AnchoSepalo               4.4
LargoPetalo               6.9
AnchoPetalo               2.5
Especie        Iris-virginica
dtype: object

In [76]:
df.min()

LargoSepalo            4.3
AnchoSepalo            2.0
LargoPetalo            1.0
AnchoPetalo            0.1
Especie        Iris-setosa
dtype: object

In [77]:
df.median()

LargoSepalo    5.80
AnchoSepalo    3.00
LargoPetalo    4.35
AnchoPetalo    1.30
dtype: float64

In [78]:
df.min()

LargoSepalo            4.3
AnchoSepalo            2.0
LargoPetalo            1.0
AnchoPetalo            0.1
Especie        Iris-setosa
dtype: object

In [79]:
df.median()

LargoSepalo    5.80
AnchoSepalo    3.00
LargoPetalo    4.35
AnchoPetalo    1.30
dtype: float64

In [80]:
df.std()

LargoSepalo    0.828066
AnchoSepalo    0.435866
LargoPetalo    1.765298
AnchoPetalo    0.762238
dtype: float64

# How to write a data frame to a File

To save a file with your data simply use the `to_csv` attribute

Examples:
- df.to_csv('myDataFrame.csv')
- df.to_csv('myDataFrame.csv', sep='\t')

In [81]:
df.to_csv('myDataFrameIris.csv')
df.to_csv('myDataFrameIris2.csv', sep='\t')

# Rename columns

To change the name of a colum use the `rename` attribute

Example:

df = df.rename(columns={"Age": "Edad"})

df.head()

In [82]:
df1 =df.rename(columns={"Especie":"TipoPlanta"})

df1.head(3)

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo   TipoPlanta
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa

In [83]:
# Back to the original name
df.head(3)

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa

# Selection of colums

As discussed above, a Pandas data frame is a rectangular data table, in which the rows represent observations or samples and the columns represent variables.  One common manipulation of a data frame is to extract the data for one case or for one variable.  There are several ways to do this, as shown below.

To extract all the values for one column (variable), use one of the following alternatives.

In [89]:
#opciones para seleccionar una columna
a = df.Especie
b = df["Especie"]
c = df.loc[:, "Especie"]
d = df.iloc[:, 4]

print(a)

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Especie, Length: 150, dtype: object

In [86]:
print(b)

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Especie, Length: 150, dtype: object

In [87]:
print(c)

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Especie, Length: 150, dtype: object

In [88]:
print(d)

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Especie, Length: 150, dtype: object

In [90]:
#Opcion para seleccionar varias columnas
df[["LargoPetalo", "Especie"]]

     LargoPetalo         Especie
0            1.4     Iris-setosa
1            1.4     Iris-setosa
2            1.3     Iris-setosa
3            1.5     Iris-setosa
4            1.4     Iris-setosa
..           ...             ...
145          5.2  Iris-virginica
146          5.0  Iris-virginica
147          5.2  Iris-virginica
148          5.4  Iris-virginica
149          5.1  Iris-virginica

[150 rows x 2 columns]

# Slicing a data set

As discussed above, a Pandas data frame is a rectangular data table, in which the rows represent cases and the columns represent variables.  One common manipulation of a data frame is to extract the data for one observation or for one variable.  There are several ways to do this, as shown below.

Lets say we would like to splice our data frame and select only specific portions of our data.  There are three different ways of doing so.

1. .loc()
2. .iloc()
3. .ix()

We will cover the .loc() and .iloc() splicing functions.

The attibute **.loc()** uses labels/column names, in specific, it takes two single/list/range operator separated by ',', the first one indicates the rows and the second one indicates columns.

In [91]:
# Return all observations of Especie
df.loc[:,"Especie"]

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Especie, Length: 150, dtype: object

In [92]:
# Return a subset of observations of Especie
df.loc[:9, "Especie"]

0    Iris-setosa
1    Iris-setosa
2    Iris-setosa
3    Iris-setosa
4    Iris-setosa
5    Iris-setosa
6    Iris-setosa
7    Iris-setosa
8    Iris-setosa
9    Iris-setosa
Name: Especie, dtype: object

In [94]:
# Select all rows for multiple columns, ["AnchoPetalo", "Especie"]
df.loc[:,["AnchoPetalo", "Especie"]]

     AnchoPetalo         Especie
0            0.2     Iris-setosa
1            0.2     Iris-setosa
2            0.2     Iris-setosa
3            0.2     Iris-setosa
4            0.2     Iris-setosa
..           ...             ...
145          2.3  Iris-virginica
146          1.9  Iris-virginica
147          2.0  Iris-virginica
148          2.3  Iris-virginica
149          1.8  Iris-virginica

[150 rows x 2 columns]

In [97]:
# Select multiple columns, ["LargoSepalo", "Especie"]me 

keep = ['LargoSepalo', 'Especie']
df_LargoSep = df[keep]

print(df_LargoSep)

     LargoSepalo         Especie
0            5.1     Iris-setosa
1            4.9     Iris-setosa
2            4.7     Iris-setosa
3            4.6     Iris-setosa
4            5.0     Iris-setosa
..           ...             ...
145          6.7  Iris-virginica
146          6.3  Iris-virginica
147          6.5  Iris-virginica
148          6.2  Iris-virginica
149          5.9  Iris-virginica

[150 rows x 2 columns]

In [98]:
# Select few rows for multiple columns, ["LargoSepalo", "AnchoSepalo", "Especie"]
df.loc[4:9, ["LargoSepalo", "AnchoSepalo", "Especie"]]

   LargoSepalo  AnchoSepalo      Especie
4          5.0          3.6  Iris-setosa
5          5.4          3.9  Iris-setosa
6          4.6          3.4  Iris-setosa
7          5.0          3.4  Iris-setosa
8          4.4          2.9  Iris-setosa
9          4.9          3.1  Iris-setosa

In [99]:
# Select range of rows for all columns
df.loc[10:15,:]

    LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
10          5.4          3.7          1.5          0.2  Iris-setosa
11          4.8          3.4          1.6          0.2  Iris-setosa
12          4.8          3.0          1.4          0.1  Iris-setosa
13          4.3          3.0          1.1          0.1  Iris-setosa
14          5.8          4.0          1.2          0.2  Iris-setosa
15          5.7          4.4          1.5          0.4  Iris-setosa

The attribute **iloc()** is an integer based slicing.

In [104]:
# .
df.iloc[1:5, 3:6]

# This is incorrect:
#df.iloc[1:5, ["Especie", "AnchoPetalo"]]

   AnchoPetalo      Especie
1          0.2  Iris-setosa
2          0.2  Iris-setosa
3          0.2  Iris-setosa
4          0.2  Iris-setosa

In [101]:
# .
df.iloc[:4, :]

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa

In [103]:
# .
df.iloc[:, 3:7]

     AnchoPetalo         Especie
0            0.2     Iris-setosa
1            0.2     Iris-setosa
2            0.2     Iris-setosa
3            0.2     Iris-setosa
4            0.2     Iris-setosa
..           ...             ...
145          2.3  Iris-virginica
146          1.9  Iris-virginica
147          2.0  Iris-virginica
148          2.3  Iris-virginica
149          1.8  Iris-virginica

[150 rows x 2 columns]

In [105]:
# .
df.iloc[4:8, 2:4]

   LargoPetalo  AnchoPetalo
4          1.4          0.2
5          1.7          0.4
6          1.4          0.3
7          1.5          0.2

# Get unique existing values

List unique values in the one of the columns

df.Gender.unique()

In [106]:
# List unique values in the df['LargoPetalo'] column
df.LargoPetalo.unique()

array([1.4, 1.3, 1.5, 1.7, 1.6, 1.1, 1.2, 1. , 1.9, 4.7, 4.5, 4.9, 4. ,
       4.6, 3.3, 3.9, 3.5, 4.2, 3.6, 4.4, 4.1, 4.8, 4.3, 5. , 3.8, 3.7,
       5.1, 3. , 6. , 5.9, 5.6, 5.8, 6.6, 6.3, 6.1, 5.3, 5.5, 6.7, 6.9,
       5.7, 6.4, 5.4, 5.2])

In [107]:
# Lets explore df["Especie"] as well

df.Especie.unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

# Filter, Sort and Groupby

With **Filter** you can use different conditions to filter columns. For example, df[df[year] > 1984] would give you only the column year is greater than 1984. You can use & (and) or | (or) to add different conditions to your filtering. This is also called boolean filtering.

df[df["Height"] >= 70]

With **Sort** is possible to sort values in a certain column in an ascending order using `df.sort_values("ColumnName")` or in descending order using `df.sort_values(ColumnName, ascending=False)`. 

Furthermore, it’s possible to sort values by Column1Name in ascending order then Column2Name in descending order by using `df.sort_values([Column1Name,Column2Name],ascending=[True,False])`


df.sort_values("Height") 
#df.sort_values("Height",ascending=False)

The attribute **Groupby** involves splitting the data into groups based on some criteria, applying a function to each group independently and combining the results into a data structure. df.groupby(col) returns a groupby object for values from one column while df.groupby([col1,col2]) returns a groupby object for values from multiple columns.

df.groupby(['Gender'])

Size of each group

df.groupby(['Gender']).size()

df.groupby(['Gender','GenderGroup']).size()

This output indicates that we have two types of combinations. 

* Case 1: Gender = F & Gender Group = 1 
* Case 2: Gender = M & GenderGroup = 2.  

This validates our initial assumption that these two fields essentially portray the same information.

# Data Cleaning: handle with missing data

Before getting started to work with your data, it's a good practice to observe it thoroughly to identify missing values and handle them accordingly.

When reading a dataset using Pandas, there is a set of values including 'NA', 'NULL', and 'NaN' that are taken by default to represent a missing value.  The full list of default missing value codes is in the '`read_csv`' documentation [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html).  This document also explains how to change the way that '`read_csv`' decides whether a variable's value is missing.

Pandas has functions called `isnull` and `notnull` that can be used to identify where the missing and non-missing values are located in a data frame.  

Below we use these functions to count the number of missing and non-missing values in each variable of the datasetr.

In [108]:
df.isnull()

     LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo  Especie
0          False        False        False        False    False
1          False        False        False        False    False
2          False        False        False        False    False
3          False        False        False        False    False
4          False        False        False        False    False
..           ...          ...          ...          ...      ...
145        False        False        False        False    False
146        False        False        False        False    False
147        False        False        False        False    False
148        False        False        False        False    False
149        False        False        False        False    False

[150 rows x 5 columns]

Unfortunately, our output indicates that some of our columns contain missing values so we are no able to continue on doing analysis with those colums

In [109]:
df.notnull()

     LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo  Especie
0           True         True         True         True     True
1           True         True         True         True     True
2           True         True         True         True     True
3           True         True         True         True     True
4           True         True         True         True     True
..           ...          ...          ...          ...      ...
145         True         True         True         True     True
146         True         True         True         True     True
147         True         True         True         True     True
148         True         True         True         True     True
149         True         True         True         True     True

[150 rows x 5 columns]

In [110]:
df.notnull().sum()

LargoSepalo    150
AnchoSepalo    150
LargoPetalo    150
AnchoPetalo    150
Especie        150
dtype: int64

In [111]:
df.isnull().sum()

LargoSepalo    0
AnchoSepalo    0
LargoPetalo    0
AnchoPetalo    0
Especie        0
dtype: int64

Now we use these functions to count the number of missing and non-missing values in a single variable in the dataset

print( df.Height.notnull().sum() )

print( pd.isnull(df.Height).sum() )

In [113]:
print( df.LargoPetalo.notnull().sum() )

print( pd.isnull(df.LargoPetalo).sum() )

150
0

In [114]:
# Extract all non-missing values of one of the columns into a new variable
x = df.AnchoPetalo.dropna().describe()
x.describe()

count      8.000000
mean      19.745196
std       52.636648
min        0.100000
25%        0.646678
50%        1.249667
75%        1.975000
max      150.000000
Name: AnchoPetalo, dtype: float64

# Add and eliminate columns

In some cases it is useful to create or eiminate new columns

In [115]:
df.head()

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa
4          5.0          3.6          1.4          0.2  Iris-setosa

In [129]:
# Add a new column with new data


# Create a column data
NewColumnData = df.AnchoPetalo*100

# Insert that column in the data frame
df.insert(5, "AnchoPetalox100", NewColumnData, True)

In [124]:
df.head()

,LargoSepalo,AnchoSepalo,LargoPetalo,AnchoPetalo,Especie,AnchoPetalox100
0,5.1,3.5,1.4,0.2,Iris-setosa,20.0
1,4.9,3.0,1.4,0.2,Iris-setosa,20.0
2,4.7,3.2,1.3,0.2,Iris-setosa,20.0
3,4.6,3.1,1.5,0.2,Iris-setosa,20.0
4,5.0,3.6,1.4,0.2,Iris-setosa,20.0

In [130]:
# # Eliminate inserted column
#df.drop("AnchoPetalox100", axis=1, inplace = True)
#df.drop(columns=['AnchoPetalox100'], inplace = True)
# # Remove three columns as index base
df.drop(df.columns[[5]], axis = 1, inplace = True)

df.head()

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa
4          5.0          3.6          1.4          0.2  Iris-setosa

In [138]:
# # Add new column derived from existing columns
#
# # The new column is a function of another column
df["AnchoSepalox10"] = df["AnchoSepalo"] * 10
# 
df.head()

,LargoSepalo,AnchoSepalo,LargoPetalo,AnchoPetalo,Especie,AnchoSepalox10
0,5.1,3.5,1.4,0.2,Iris-setosa,35.0
1,4.9,3.0,1.4,0.2,Iris-setosa,30.0
2,4.7,3.2,1.3,0.2,Iris-setosa,32.0
3,4.6,3.1,1.5,0.2,Iris-setosa,31.0
4,5.0,3.6,1.4,0.2,Iris-setosa,36.0

In [139]:
# # Eliminate inserted column
df.drop("AnchoSepalox10", axis=1, inplace = True)
#
df.head()

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa
4          5.0          3.6          1.4          0.2  Iris-setosa

In [141]:
#Add a new column with text labels reflecting the code's meaning

df["EspecieNuevoNombre"] = df.Especie.replace({"Iris-setosa": "planta1", "Iris-virginica": "planta2"})

# Show the first 5 rows of the created data frame
df

,LargoSepalo,AnchoSepalo,LargoPetalo,AnchoPetalo,Especie,EspecieNuevoNombre
0,5.1,3.5,1.4,0.2,Iris-setosa,planta1
1,4.9,3.0,1.4,0.2,Iris-setosa,planta1
2,4.7,3.2,1.3,0.2,Iris-setosa,planta1
3,4.6,3.1,1.5,0.2,Iris-setosa,planta1
4,5.0,3.6,1.4,0.2,Iris-setosa,planta1
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,planta2
146,6.3,2.5,5.0,1.9,Iris-virginica,planta2
147,6.5,3.0,5.2,2.0,Iris-virginica,planta2
148,6.2,3.4,5.4,2.3,Iris-virginica,planta2
149,5.9,3.0,5.1,1.8,Iris-virginica,planta2

In [142]:
## Eliminate inserted column
df.drop("EspecieNuevoNombre", axis=1, inplace = True)
#df.drop(['GenderGroupNew'],axis='columns',inplace=True)

df.head()

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa
4          5.0          3.6          1.4          0.2  Iris-setosa

In [147]:
## Add a new column with strata based on these cut points
#
## Create a column data
NewColumnData = df.AnchoSepalo/df.AnchoSepalo
#
## Insert that column in the data frame
df.insert(1, "ColumnStrata", NewColumnData, True)
#
df["ColumnStrata"] = pd.cut(df.AnchoSepalo, [2., 3., 3.1, 4.])
#
## Show the first 5 rows of the created data frame
df.head()

,LargoSepalo,ColumnStrata,ColumnStrata,AnchoSepalo,LargoPetalo,AnchoPetalo,Especie
0,5.1,"(3.1, 4.0]","(3.1, 4.0]",3.5,1.4,0.2,Iris-setosa
1,4.9,"(2.0, 3.0]","(2.0, 3.0]",3.0,1.4,0.2,Iris-setosa
2,4.7,"(3.1, 4.0]","(3.1, 4.0]",3.2,1.3,0.2,Iris-setosa
3,4.6,"(3.0, 3.1]","(3.0, 3.1]",3.1,1.5,0.2,Iris-setosa
4,5.0,"(3.1, 4.0]","(3.1, 4.0]",3.6,1.4,0.2,Iris-setosa

In [148]:
## Eliminate inserted column
df.drop("ColumnStrata", axis=1, inplace = True)
#
df.head()

   LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo      Especie
0          5.1          3.5          1.4          0.2  Iris-setosa
1          4.9          3.0          1.4          0.2  Iris-setosa
2          4.7          3.2          1.3          0.2  Iris-setosa
3          4.6          3.1          1.5          0.2  Iris-setosa
4          5.0          3.6          1.4          0.2  Iris-setosa

In [149]:
# Drop several "unused" columns
vars = ["AnchoSepalo", "LargoSepalo"]
df.drop(vars, axis=1, inplace = True)
df.head()

   LargoPetalo  AnchoPetalo      Especie
0          1.4          0.2  Iris-setosa
1          1.4          0.2  Iris-setosa
2          1.3          0.2  Iris-setosa
3          1.5          0.2  Iris-setosa
4          1.4          0.2  Iris-setosa

# Add and eliminate rows

In some cases it is requiered to add new observations (rows) to the data set

In [49]:
# Print tail

In [50]:
#df.loc[len(df.index)] = [26, 24, 'F', 1, 'Y', 1, 66, 'NaN', 68, 'N', 0, 3] 
#
#df.tail()

In [51]:
## Eliminate inserted row
#df.drop([28], inplace = True )
#
#df.tail()

# Cleaning your data: drop out unused columns and/or drop out rows with any missing values

In [52]:
# Drop unused columns
#vars = ["ID", "GenderGroup", "GlassesGroup", "CompleteGroup"]
#df.drop(vars, axis=1, inplace = True)

#vars = ["Age", "Gender", "Glasses", "Height", "Wingspan", "CWDistance", "Complete", "Score"]
#df = df[vars]

# Drop rows with any missing values
#df = df.dropna()

# Drop unused columns and drop rows with any missing values
#vars = ["Age", "Gender", "Glasses", "Height", "Wingspan", "CWDistance", "Complete", "Score"]
#df = df[vars].dropna()

#df

# Final remarks


- The understanding of your dataset is essential
    - Number of observations
    - Variables
    - Data types: numerical or categorial
    - What are my variables of interest

- There are several ways to do the same thing

- Cleaning your dataset (dropping out rows with any missing values) is a good practice

- The **Pandas** library provides fancy, high-performance, easy-to-use data structures and data analysis tools

# Activity: work with the iris dataset

Repeat this tutorial with the iris data set and respond to the following inquiries

1. Calculate the statistical summary for each quantitative variables. Explain the results
    - Identify the name of each column:

In [156]:
df.columns

Index(['LargoSepalo', 'AnchoSepalo', 'LargoPetalo', 'AnchoPetalo', 'Especie'], dtype='object')

- Identify the type of each column:

In [154]:
df.dtypes

LargoSepalo    float64
AnchoSepalo    float64
LargoPetalo    float64
AnchoPetalo    float64
Especie         object
dtype: object

- Minimum, maximum, mean, average, median, standar deviation

In [155]:
df.describe()

       LargoSepalo  AnchoSepalo  LargoPetalo  AnchoPetalo
count   150.000000   150.000000   150.000000   150.000000
mean      5.843333     3.057333     3.758000     1.199333
std       0.828066     0.435866     1.765298     0.762238
min       4.300000     2.000000     1.000000     0.100000
25%       5.100000     2.800000     1.600000     0.300000
50%       5.800000     3.000000     4.350000     1.300000
75%       6.400000     3.300000     5.100000     1.800000
max       7.900000     4.400000     6.900000     2.500000

2. Are there missing data? If so, create a new dataset containing only the rows with the non-missing data

In [157]:
df.isnull().sum()

LargoSepalo    0
AnchoSepalo    0
LargoPetalo    0
AnchoPetalo    0
Especie        0
dtype: int64

Debido a que no hay datos faltantes no sera necesario crear un nuevo dataset

3. Create a new dataset containing only the petal width and length and the type of Flower

In [162]:
df.drop(df.columns[[0]], axis = 1, inplace = True)
df.drop(df.columns[[0]], axis = 1, inplace = True)


df.head()

   LargoPetalo  AnchoPetalo      Especie
0          1.4          0.2  Iris-setosa
1          1.4          0.2  Iris-setosa
2          1.3          0.2  Iris-setosa
3          1.5          0.2  Iris-setosa
4          1.4          0.2  Iris-setosa

4. Create a new dataset containing only the setal width and length and the type of Flower

In [165]:
df.drop(df.columns[[2]], axis = 1, inplace = True)
df.drop(df.columns[[2]], axis = 1, inplace = True)


df.head()

   LargoSepalo  AnchoSepalo      Especie
0          5.1          3.5  Iris-setosa
1          4.9          3.0  Iris-setosa
2          4.7          3.2  Iris-setosa
3          4.6          3.1  Iris-setosa
4          5.0          3.6  Iris-setosa

5. Create a new dataset containing the setal width and length and the type of Flower encoded as a categorical numerical column

In [170]:
df.drop(df.columns[[2]], axis = 1, inplace = True)
df.drop(df.columns[[2]], axis = 1, inplace = True)

df["EspecieNumerica"] = df.Especie.replace({"Iris-setosa": 1, "Iris-versicolor": 2, "Iris-virginica": 3})

df.drop(df.columns[[2]], axis = 1, inplace = True)
df

     LargoSepalo  AnchoSepalo  EspecieNumerica
0            5.1          3.5                1
1            4.9          3.0                1
2            4.7          3.2                1
3            4.6          3.1                1
4            5.0          3.6                1
..           ...          ...              ...
145          6.7          3.0                3
146          6.3          2.5                3
147          6.5          3.0                3
148          6.2          3.4                3
149          5.9          3.0                3

[150 rows x 3 columns]